app/controllers/api/trips_controller.rb

INSERT INTO "flights" ("status", "airline", "arrival_airport", "departure_airport", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    if current_user && user.is_employee
      @flight = Flight.new(
                          status: params[:status],
                          airline: params[:airline],
                          arrival_time: params[:arrival_time],
                          departure_time: params[:departure_time],
                          arrival_airport: params[:arrival_airport],
                          departure_airport: params[:departure_airport],
                          boarding_time: params[:boarding_time]
                          )
      @flight.save

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @flight = Flight.find(params[:id])

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "flights" SET "arrival_time" = $1, "departure_time" = $2, "boarding_time" = $3, "updated_at" = $4 WHERE "flights"."id" = $5
---
  def update
    if current_user && user_type
      @flight = Flight.find(params[:id])

      @flight.status = params[:status] || @flight.status
      @flight.airline = params[:airline] || @flight.airline
      @flight.arrival_time = params[:arrival_time] || @flight.arrival_time
      @flight.departure_time = params[:departure_time] || @flight.departure_time
      @flight.arrival_airport = params[:arrival_airport] || @flight.arrival_airport
      @flight.departure_airport = params[:departure_airport] || @flight.departure_airport
      @flight.boarding_time = params[:boarding_time] || @flight.boarding_time

    @flight.save

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "flights" WHERE "flights"."id" = $1  [["id", 21]]
---
  def destroy
    if current_user && user_type
      @flight = Flight.find(params[:id])
      @flight.destroy